// Завдання 3: Числа та булі

// Створіть змінну яка буде символізувати вік певної персони.

// Після чого створіть булеву змінну яка буде визначати чи особа повнолітня базуючись на заченні з попередньої змінної.

// Виведіть усі змінні в консоль

let personAge = 20;
let adultAge = 18;
let isPersonAdult = personAge >= adultAge;
console.log(isPersonAdult);




// Завдання 4: Обчислення площі та об'єму

// Завдання 4.1

// π - число “пі”. Ви можете використати Math.PI у вашому дз для вираження цього числа

// Створіть змінну radius і присвойте їй числове значення радіуса кола.
// Обчисліть площу кола за формулою π * radius^2 і виведіть результат.


let radius = 10;
let area1 = (Math.PI * (radius ** 2));
console.log(area1.toFixed(2));

// Завдання 4.2

// Створіть змінну length і присвойте їй числове значення довжини прямокутника.
// Створіть змінну width і присвойте їй числове значення ширини прямокутника.
// Обчисліть площу прямокутника за формулою length * width і виведіть результат.
let length = 20;
let width = 30;
let area2 = length * width;
console.log(area2.toFixed(2));



// Завдання 4.3


let radius2 = 10;
let height = 20;
let result = (Math.PI * Math.pow(radius2, 2) * height).toFixed(2);
console.log(result);
// Створіть змінну radius і присвойте їй числове значення радіуса циліндра.
// Створіть змінну height і присвойте їй числове значення висоти циліндра.
// Обчисліть об'єм циліндра за формулою π * radius^2 * height і виведіть результат.


